In [42]:
import numpy as np
from scipy import stats
import pandas as pd
import new_lib as nl
import env as env

A bank found that the average number of cars waiting during the noon hour at a drive-up window follows a Poisson distribution with a mean of 2 cars. Make a chart of this distribution and answer these questions concerning the probability of cars waiting at the drive-up window.

What is the probability that no cars drive up in the noon hour?
What is the probability that 3 or more cars come through the drive through?
How likely is it that the drive through gets at least 1 car?

In [2]:
stats.poisson(2).pmf(0)

0.1353352832366127

In [3]:
stats.poisson(2).sf(3)

0.14287653950145296

In [4]:
stats.poisson(2).sf(1)

0.5939941502901616

Grades of State University graduates are normally distributed with a mean of 3.0 and a standard deviation of .3. Calculate the following:

What grade point average is required to be in the top 5% of the graduating class?
What GPA constitutes the bottom 15% of the class?
An eccentric alumnus left scholarship money for students in the third decile from the bottom of their class. Determine the range of the third decile. Would a student with a 2.8 grade point average qualify for this scholarship?
If I have a GPA of 3.5, what percentile am I in?

In [8]:
gpa = stats.norm(3.0,.3)

In [9]:
gpa.ppf(.95)

3.4934560880854417

In [10]:
gpa.ppf(.15)

2.689069983151863

In [12]:
gpa.ppf(.3)
#2.8 qualifies

2.842679846187588

In [13]:
gpa.ppf(.4)-gpa.ppf(.3)

0.08131602287167228

In [14]:
gpa.cdf(3.5)
#95th percentile

0.9522096477271853

A marketing website has an average click-through rate of 2%. One day they observe 4326 visitors and 97 click-throughs. How likely is it that this many people or more click through?

In [18]:
stats.binom(4326,.02).sf(96)

0.13975823631416448

You are working on some statistics homework consisting of 100 questions where all of the answers are a probability rounded to the hundreths place. Looking to save time, you put down random probabilities as the answer to each question.

What is the probability that at least one of your first 60 answers is correct?

In [21]:
stats.binom(60,.01).sf(0)
#45.28% chance that at least one answer is right

0.45284335760923855

The codeup staff tends to get upset when the student break area is not cleaned up. Suppose that there's a 3% chance that any one student cleans the break area when they visit it, and, on any given day, about 90% of the 3 active cohorts of 22 students visit the break area. How likely is it that the break area gets cleaned up each day? How likely is it that it goes two days without getting cleaned up? All week?

In [26]:
.9*22*3

59.400000000000006

In [30]:
day = stats.binom(59,.03).sf(0)
day
#83.42% chance the break room is cleaned each day

0.8342199288437352

In [32]:
no_clean = 1 - day

In [33]:
no_clean ** 2
#2.75% chance it goes 2 days without any cleaning

0.027483031992576224

In [34]:
no_clean ** 7
#.000344% chance that it goes seven days without being cleaned

3.44132945698801e-06

You want to get lunch at La Panaderia, but notice that the line is usually very long at lunchtime. After several weeks of careful observation, you notice that the average number of people in line when your lunch break starts is normally distributed with a mean of 15 and standard deviation of 3. If it takes 2 minutes for each person to order, and 10 minutes from ordering to getting your food, what is the likelihood that you have at least 15 minutes left to eat your food before you have to go back to class? Assume you have one hour for lunch, and ignore travel time to and from La Panaderia.

In [36]:
line = stats.norm(15,3)

In [39]:
(60-25)/2

17.5

In [40]:
line.cdf(17)

0.7475074624530771

In [45]:
url = nl.get_db_url('employees')

In [53]:
query = 'SELECT * FROM salaries WHERE to_date >= NOW()'

In [54]:
sql = pd.read_sql(query, url)

Connect to the employees database and find the average salary of current employees, along with the standard deviation. For the following questions, calculate the answer based on modeling the employees salaries with a normal distribution defined by the calculated mean and standard deviation then compare this answer to the actual values present in the salaries dataset.

What percent of employees earn less than 60,000?
What percent of employees earn more than 95,000?
What percent of employees earn between 65,000 and 80,000?
What do the top 5% of employees make?

In [60]:
sql

        emp_no  salary   from_date     to_date
0        10001   88958  2002-06-22  9999-01-01
1        10002   72527  2001-08-02  9999-01-01
2        10003   43311  2001-12-01  9999-01-01
3        10004   74057  2001-11-27  9999-01-01
4        10005   94692  2001-09-09  9999-01-01
...        ...     ...         ...         ...
240119  499995   52868  2002-06-01  9999-01-01
240120  499996   69501  2002-05-12  9999-01-01
240121  499997   83441  2001-08-26  9999-01-01
240122  499998   55003  2001-12-25  9999-01-01
240123  499999   77303  2001-11-29  9999-01-01

[240124 rows x 4 columns]

In [73]:
num_emp = len(sql)
num_emp

240124

In [67]:
nquery = 'SELECT * FROM salaries WHERE to_date >= NOW() AND salary < 60000'

In [75]:
low_earn = len(pd.read_sql(nquery, url))

In [76]:
low_earn/num_emp
#27.06% make less than 60000

0.2705727041028802

In [77]:
mquery = 'SELECT * FROM salaries WHERE to_date >= NOW() AND salary > 95000'

In [78]:
high_earn = len(pd.read_sql(mquery, url))

In [79]:
high_earn/num_emp
# 10.86% make more than 95000

0.1086272092752078

In [80]:
squery = 'SELECT * FROM salaries WHERE to_date >= NOW() AND salary BETWEEN 65000 AND 80000'

In [81]:
mid_earn = len(pd.read_sql(squery, url))

In [82]:
mid_earn/num_emp

0.32515700221552196

In [83]:
num_emp * .05

12006.2

In [92]:
kquery = 'SELECT * FROM salaries WHERE to_date >= NOW() ORDER BY salary DESC LIMIT 12006'

In [93]:
top5 = pd.read_sql(kquery, url)
top5

       emp_no  salary   from_date     to_date
0       43624  158220  2002-03-22  9999-01-01
1      254466  156286  2001-08-04  9999-01-01
2       47978  155709  2002-07-14  9999-01-01
3      253939  155513  2002-04-11  9999-01-01
4      109334  155190  2002-02-11  9999-01-01
...       ...     ...         ...         ...
12001  448855  104232  2002-07-08  9999-01-01
12002  409170  104230  2002-01-28  9999-01-01
12003   72377  104229  2002-06-30  9999-01-01
12004   51196  104229  2001-08-27  9999-01-01
12005  208337  104228  2002-03-11  9999-01-01

[12006 rows x 4 columns]

In [97]:
top5.salary.mean()
#average salary for top 5% earners

113408.81750791271